adamkondraciuk/nrfx/mdk/iar_startup_nrf7140_secure.s
        PUBWEAK  DISPC_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
DISPC_1_IRQHandler
        B .

        PUBWEAK  DISPC_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
DISPC_2_IRQHandler
        B .

        PUBWEAK  GPU_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPU_IRQHandler
        B .

        PUBWEAK  MPC200_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MPC200_IRQHandler
        B .

        PUBWEAK  SPU200_SPU210_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU200_SPU210_IRQHandler
        B .

        PUBWEAK  CTRLAP_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
CTRLAP_IRQHandler
        B .

        PUBWEAK  TBM_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TBM_IRQHandler
        B .

        PUBWEAK  SPU110_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU110_IRQHandler
        B .

        PUBWEAK  MPC110_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MPC110_IRQHandler
        B .

        PUBWEAK  USBHS_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
USBHS_IRQHandler
        B .

        PUBWEAK  SPU111_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU111_IRQHandler
        B .

        PUBWEAK  MPC111_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MPC111_IRQHandler
        B .

        PUBWEAK  MRAMC110_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MRAMC110_IRQHandler
        B .

        PUBWEAK  MRAMC111_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MRAMC111_IRQHandler
        B .

        PUBWEAK  EXMIF_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EXMIF_IRQHandler
        B .

        PUBWEAK  SPU120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU120_IRQHandler
        B .

        PUBWEAK  MPC120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MPC120_IRQHandler
        B .

        PUBWEAK  OTPC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
OTPC_IRQHandler
        B .

        PUBWEAK  VPR120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPR120_IRQHandler
        B .

        PUBWEAK  SPU121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU121_IRQHandler
        B .

        PUBWEAK  IPCT120_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT120_0_IRQHandler
        B .

        PUBWEAK  I3C120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
I3C120_IRQHandler
        B .

        PUBWEAK  VPR121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPR121_IRQHandler
        B .

        PUBWEAK  QSPI120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
QSPI120_IRQHandler
        B .

        PUBWEAK  CAN120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
CAN120_IRQHandler
        B .

        PUBWEAK  MVDMA120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MVDMA120_IRQHandler
        B .

        PUBWEAK  CAN121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
CAN121_IRQHandler
        B .

        PUBWEAK  MVDMA121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MVDMA121_IRQHandler
        B .

        PUBWEAK  I3C121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
I3C121_IRQHandler
        B .

        PUBWEAK  QSPI121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
QSPI121_IRQHandler
        B .

        PUBWEAK  SPU122_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU122_IRQHandler
        B .

        PUBWEAK  TIMER120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER120_IRQHandler
        B .

        PUBWEAK  TIMER121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER121_IRQHandler
        B .

        PUBWEAK  PWM120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM120_IRQHandler
        B .

        PUBWEAK  SPIS120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPIS120_IRQHandler
        B .

        PUBWEAK  SPIM120_UARTE120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPIM120_UARTE120_IRQHandler
        B .

        PUBWEAK  SPIM121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPIM121_IRQHandler
        B .

        PUBWEAK  SPIM122_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPIM122_IRQHandler
        B .

        PUBWEAK  SPIM123_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPIM123_IRQHandler
        B .

        PUBWEAK  SPU130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU130_IRQHandler
        B .

        PUBWEAK  MPC130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MPC130_IRQHandler
        B .

        PUBWEAK  VPR130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPR130_IRQHandler
        B .

        PUBWEAK  SPU131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU131_IRQHandler
        B .

        PUBWEAK  IPCT130_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT130_0_IRQHandler
        B .

        PUBWEAK  RTC130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RTC130_IRQHandler
        B .

        PUBWEAK  RTC131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RTC131_IRQHandler
        B .

        PUBWEAK  WDT131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
WDT131_IRQHandler
        B .

        PUBWEAK  WDT132_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
WDT132_IRQHandler
        B .

        PUBWEAK  EGU130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EGU130_IRQHandler
        B .

        PUBWEAK  RESETHUB_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RESETHUB_IRQHandler
        B .

        PUBWEAK  AUDIOPLL_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
AUDIOPLL_IRQHandler
        B .

        PUBWEAK  USBHSPLL_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
USBHSPLL_IRQHandler
        B .

        PUBWEAK  VREGUSB_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VREGUSB_IRQHandler
        B .

        PUBWEAK  AUDIOPLLPM_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
AUDIOPLLPM_IRQHandler
        B .

        PUBWEAK  SPU132_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU132_IRQHandler
        B .

        PUBWEAK  SAADC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SAADC_IRQHandler
        B .

        PUBWEAK  COMP_LPCOMP_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
COMP_LPCOMP_IRQHandler
        B .

        PUBWEAK  TEMP_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TEMP_IRQHandler
        B .

        PUBWEAK  NFCT_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
NFCT_IRQHandler
        B .

        PUBWEAK  SPU133_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU133_IRQHandler
        B .

        PUBWEAK  TDM130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TDM130_IRQHandler
        B .

        PUBWEAK  QDEC130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
QDEC130_IRQHandler
        B .

