adamkondraciuk/nrfx/mdk/iar_startup_nrf7140_secure.s
        PUBWEAK  QDEC131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
QDEC131_IRQHandler
        B .

        PUBWEAK  SIMIF130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SIMIF130_IRQHandler
        B .

        PUBWEAK  TDM131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TDM131_IRQHandler
        B .

        PUBWEAK  TDM132_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TDM132_IRQHandler
        B .

        PUBWEAK  SPU134_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU134_IRQHandler
        B .

        PUBWEAK  TIMER130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER130_IRQHandler
        B .

        PUBWEAK  TIMER131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER131_IRQHandler
        B .

        PUBWEAK  PWM130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM130_IRQHandler
        B .

        PUBWEAK  SERIAL0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL0_IRQHandler
        B .

        PUBWEAK  SERIAL1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL1_IRQHandler
        B .

        PUBWEAK  PDM130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PDM130_IRQHandler
        B .

        PUBWEAK  SPU135_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU135_IRQHandler
        B .

        PUBWEAK  TIMER132_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER132_IRQHandler
        B .

        PUBWEAK  TIMER133_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER133_IRQHandler
        B .

        PUBWEAK  PWM131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM131_IRQHandler
        B .

        PUBWEAK  SERIAL2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL2_IRQHandler
        B .

        PUBWEAK  SERIAL3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL3_IRQHandler
        B .

        PUBWEAK  PDM131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PDM131_IRQHandler
        B .

        PUBWEAK  SPU136_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU136_IRQHandler
        B .

        PUBWEAK  TIMER134_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER134_IRQHandler
        B .

        PUBWEAK  TIMER135_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER135_IRQHandler
        B .

        PUBWEAK  PWM132_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM132_IRQHandler
        B .

        PUBWEAK  SERIAL4_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL4_IRQHandler
        B .

        PUBWEAK  SERIAL5_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL5_IRQHandler
        B .

        PUBWEAK  PDM132_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PDM132_IRQHandler
        B .

        PUBWEAK  SPU137_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU137_IRQHandler
        B .

        PUBWEAK  TIMER136_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER136_IRQHandler
        B .

        PUBWEAK  TIMER137_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER137_IRQHandler
        B .

        PUBWEAK  PWM133_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM133_IRQHandler
        B .

        PUBWEAK  SERIAL6_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL6_IRQHandler
        B .

        PUBWEAK  SERIAL7_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL7_IRQHandler
        B .

        PUBWEAK  PDM133_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PDM133_IRQHandler
        B .

        END


